{"success":true,"type":"batch_scrape.page","id":"78f854e3-695e-493b-a78a-dc99537b537d","data":[{"markdown":"|     |     |     |     |\n| --- | --- | --- | --- |\n| Kind of Business | Criteria | License/ Registration | Fee Per Annum Rs.100 |\n| Petty Food Business Operators Manufactures or sells any kind of food by himself/herself, Petty retailer, hawker, itinerant vendor, temporary stall, Thela, Sweets Shop, Juice Stall. etc. e.g Gol gappa stall, fruits/vegetables vendors, snacks stall, Tea Stall, Samosa, Bread pakoda, retail shops, Temporary Food Stalls like Chinese food stall, South Indian Food etc.. Temporary or fixed stall or food premise involved in preparation, | Annual Turnover upto Rs. 12 Lacs storage, distribution and sale of food products that can be served as a | Registration |  |\n| Hawker - Selling packaged or freshly prepared food by travelling (usually. on foot or movable carts) from one location to other. Dairy Units including Milk Chilling Units. Dairy processing means handling, processing, manufacturing, packing, | More than 50,000 Liters of Milk per day. More than 2500 MT | Central License | Rs. 7500 |\n| storing, distribution & transportation of milk and milk products.. Note: Registration for Petty Milkman, Milk Vendors, License for rest according to Eligibility criteria | of Milk Solid Per. annum 10001 - 50,000 Ltrs of Milk per day 501 MT- 2500 MT of | State License | Rs. 5000 |\n|  | Milk Solids per annum 501 - 10,000 Ltrs of Milk per day 2.5 MT - 500 MT of | State License | Rs. 3000 |\n| Milk Solids per annum Upto 500 Ltrs of Milk per day | Registration | Rs. 100 |\n| Vegetable Oil Processing Units Vegetable oil processing means processing of vegetables to produce | Upto 2.5 MT of Milk Solids per annum More than 2 MT per | Central | Rs. 7500 |\n| vegetable oils by the process of solvent extraction/expeller and refining including oil expeller units. | day 1-2 MT per day | License State | Rs. 5000 |\n| Below 1 MT per day | License State | Rs. 3000 |\n| Turnover upto Rs. 12 | License Registration | Rs. 100 |\n| Slaughtering House. Slaughtering means a process of transporting, stunning, butchering,. | Lacs per annum Large Animals: More than 50 Small Animals: More than. | Central License | Rs. 7500 |\n| dressing, processing, storing & distribution of live animal/poultry birds | 150 Poultry Birds: More than 1000 Large Animals: 3 to. 50 Small Animals: 11 to 150 Poultry Birds: | State License | Rs. 2000 |\n\n|     |     |     |     |\n| --- | --- | --- | --- |\n|  | 51 to 1000 | Rs.100 |\n| Large Small | Animals: Animals: Poultry Birds: 50 | 2 10 | Registration |\n| Meat Processing Meat processing means further processing of slaughtered animals/poultry birds into meat & meat products, packaging, storing & | More than 500 Meat per More than 150 MT Meat per annum | Central License | Rs. 7500 |\n| transportation of meat & meat products.. Fish processing means handling, processing of fish, manufacturing of fish products, packing, storing, distribution & transportation of fish and fish | Upto 500 Kg Meat per day or Upto 150 MT Meat per annum | State | Rs. 3000 |\n| products. All Food Manufacturing/ Processing units other than Dairy Units, | Lacs per annum |  |  |\n| Manufacturing/Processing Unit means a person/entity which owns or operates an establishment that manufactures or processes a food | day No Grains, Cereals or. | License |  |\n| This term includes, but is not limited to contract manufacturers, contract packers and other entities that manufactures or processes a | 101 Kgs/Ltrs - 1 MT per Day All Grains, Cereals, | State License | Rs. 3000 |\n| Manufacturing or processing means each step in conversion of raw material derived from livestock and agricultural produce into products for intermediate or final consumption. The process includes procurement, receipt, preparation, Manufacturing/processing, packaging, storage, distribution & transportation of food products. | Production Capacity Production Capacity: 1MT - 2 MT per Day | State | Rs. 5000 |\n| Repacking means packing of food product into different sizes with labelling after doing minimal processing as required like sorting, grading, sieving etc. from wholesale packages. The food product is not manipulated & the composition or formulation is not affected or | Lacs per annum Or. Production capacity upto 100 Kgs/Ltrs per | Registration | Rs. 100 |\n| changed. Proprietary Food |  |  |  |\n| Food or Health Supplements and Nutraceuticals etc.. As per Food Safety and Standards (Food or Health Supplements, | production capacity No restriction production capacity | on Central License | Rs. 7500 |\n| Nutraceuticals, Foods for Special Dietary Uses, Foods for Special Medical Purpose, Functional Foods, and Novel Food) Regulations, 2016\\] Non-specified food | No restriction | on Central | Rs. 7500 |\n\n|     |     |     |     |\n| --- | --- | --- | --- |\n| appT Standards (Approval of non-specified food and food ingredients) Regulations at FSsAl-HQ separately before applying for license. |  |  |  |\n| Radiation processing of food Radiation processing of food or food irradiation is a physical process in which food commodities, bulk or pre-packaged are exposed to controlled doses of energy of ionizing radiation such as gamma rays or | No restriction on production capacity | Central License | Rs. 7500 |\n| X-rays to achieve different technological objectives. Substances added to Food Substances added to Food means Food Additives, Enzymes and their | Production Capacity: More than 2 MT per | Central License | Rs. 7500 |\n| preparations, Source, Flavouring agents and their preparations, Processing Aids, Nutrients and their preparations, Microorganisms and Microbial Preparations & Functional Ingredients added to food as specified under Food Safety and Standards (Food Products Standards and Food Additives) Regulations. | Day Production Capacity: Up to 2 MT per Day Turnover upto Rs. 12 Lacs per annum | State License Registration | Rs. 5000 Rs. 100 |\n| Storage - Cold/Refrigerated Cold/refrigerated Storage is an activity where refrigerated/ frozen food products in packed | Storage Capacity of More than 10,000 | Central License | Rs. 7500 |\n| or unpacked condition is stored for further distribution in refrigeration/ freezing storage facilities. | MT Storage Capacity Upto 10,000 MT | State | Rs. 2000 |\n| Turnover upto Rs. 12 | License Registration | Rs. 100 |\n| Storage - Atmospheric Controlled + Cold Controlled Atmosphere | Lacs per annum Storage Capacity of | Central | Rs. 7500 |\n| Storage is an activity where food products in packed or unpacked condition is stored for further distribution in controlled atmosphere | More than 1,000 MT Storage Capacity | License State | Rs. 2000 |\n| storage facilities. A controlled atmosphere, generally used for storage of dry commodities & agricultural produce in which the concentrations of oxygen, carbon dioxide and nitrogen, as well as the temperature and | Upto 1,000 MT Turnover upto Rs. 12Registration Lacs per annum | License | Rs. 100 |\n| humidity of a storage room are regulated. Storage Without Atmospheric Controlled + Cold Storage is an activity where food products in packed or unpacked | Storage Capacity of More than 50,000 | Central License | Rs. 7500 |\n| condition is stored for further distribution in storage facilities, also called warehouses, godowns, etc | MT Storage Capacity Upto 50,000 MT | State | Rs. 2000 |\n| Turnover upto Rs. 12 Lacs per annum | License Registration | Rs. 100 |\n| Transporter (having a number of specialised vehicles like insulated refrigerated van/wagon, milk tankers etc.) Transportation is an activity of transporting food products (both packed and bulk) from one location to another in vehicles/containers including specialized vehicles like insulated refrigerated van/ wagon, oil/milk tankers etc. Food Trucks are also covered in this category | More than 100 Vehicles and Turnover more than | Central License | Rs. 7500 |\n| Rs. 30 Crores per annum Upto 100 Vehicles and Turnover. upto | State License | Rs. 2000 |\n|  | Rs. 30 Crores per annum Single Vehicle and Turnover upto Rs. 12 Lacs per annum | Registration | Rs. 100 |\n\n|     |     |     |\n| --- | --- | --- |\n| Wholesaler Wholesale is an activity in the distribution channel where food product is procured in bulk and then sold to resellers/retailers rather than to consumers | I urnover more than Rs. 30 Crores per annum | Central RS. 7500 License |\n| Turnover upto Rs. 30 State Crores per annum License | Rs. 2000 |\n| Distributor | Turnover upto Rs. 12 Lacs per annum Turnover more than Central Rs. 20 Crores per | Registration Rs. 100 Rs. 7500 |\n| Distribution is an activity in the distribution channel where food product is distributed from the original place of manufacture to the person who makes the final delivery or sale of the food product to the ultimate consumer. Retailer | annum Turnover upto Rs. 20 | License |\n| Crores per annum Turnover upto Rs. 12 | State Rs. 2000 License |\n| Lacs per annum Turnover more than Central | RegistrationRs. 100 Rs. 7500 |\n| Retail is an activity where food products is procured from a manufacturer, distributor or wholesaler and sold to the ultimate end user. E.g. Retail Shop/ Fish/ Meat/Poultry shop/ seller/Sweet Shop/Snacks/Confectionery or Bakery Shop Hotel | Rs. 20 Crores per annum | License |\n| Turnover upto Rs. 20 Crores per annum Turnover upto Rs. 12 | State Rs. 2000 License |\n| Lacs per annum Five Star and Above | Registration Rs. 100 |\n| Hotel is a commercial establishment providing lodging, meals, and other guest services. In general, to be called a hotel, an establishment must have a minimum of six letting bedrooms, at least three of which must have attached (ensuite) private bathroom facilities. | Three Star and Four | Central Rs. 7500 License |\n| Star One Star, Two Star or Hotel without Star | State Rs. 5000 License State Rs. 2000 |\n| Rating by Ministry of Tourism (HRACC) Turnover upto Rs. 12 Registration | License |\n| Restaurants Restaurant is a type of food service operation which prepares, serves | Lacs per annum Turnover more than Rs. 20 Crores per | Central Rs. 7500 License |\n| food and drinks to customers in exchange for money. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services, and some offer only take-out and delivery. Club/Canteen | annum Turnover upto Rs. 20 | State Rs. 2000 |\n| Crores per annum Turnover upto Rs. 12 | License Registration Rs. 100 |\n| Lacs per annum Turnover upto Rs. 20 State License | Rs. 2000 |\n| Canteen or Cafeteria is a dining area in an institution/ establishment serving food (being prepared in the premises or procured from other Iocation or source) to individuals associated with or visiting the | Crores per annum Turnover upto Rs. 12 Lacs per annum | Registration Rs. 100 |\n| institution Caterer Food Service Establishment involved in preparation, storage, serving and /or transport of food for consumption of a group at a venue of ceremony/celebration /ritual/institution. | Turnover more than | Central Rs. 7500 |\n| Rs. 20 Crores per annum Turnover upto Rs. 20 | License State Rs. 2000 |\n|  | Crores per annum License More Vending |  |\n| Food Vending Agencies | than 100 Central Machines License | Rs. 7500 |\n\n|     |     |     |     |\n| --- | --- | --- | --- |\n| Sale of packaged/fresh food from a temporary or fixed stall/cart/ machine by an individual or by automation. | and/or located in two or more States/UTs |  |\n| Upto 100 Vending Machines in only one | State License | Rs. 2000 |\n| State/UT Turnover upto Rs. 12 Lacs per annum or Upto 12 Vending Machines in only one. | Registration | Rs. 100 |\n| Dhaba Food service establishment generally located near roadside/highway involved in processing, storing, packaging and selling of food to. customers for consumptione | Turnover more than Rs.12 Lacs per annum Turnover upto Rs 12 Lacs per annum | State License Registration | Rs. 2000 Rs. 100 |\n| A building providing food and lodging for paying guest. Banquet halls with food catering arrangements. A specified area such as hall which is used for the purpose of hosting parties/ ceremonies involved in preparation and serving of food to |  |  |  |\n| Home Based Canteens/ Dabba Wallas. An individual or establishment involved in distribution of packed meals (usually packed lunch) from food service establishments such as home based caterer or restaurants to customers.. |  |  |  |\n| A stand/booth/compartment/small covered area being used for preparation and /or sale of freshly prepared or packaged food for consumption. This structure maybe temporary or permanent (fixed).. Food stalls/ Arrangements in religious gatherings/ fairs etc. A stand/booth/compartment/small covered area being used for |  |  |  |\n| food being offered as Prasad in a religious institution.. Importers Importers importing food items including food ingredients and additives for commercial use | Importing any type of food product with no. limit on the capacity | Central License | Rs. 7500 |\n| brought into a domestic market in the course of trade. Food Business Activities at premises of Central Govt Agencies such as Storage, Wholesale, Distribution, Retail etc. | No limit on Capacity or Turnover | Central License | Rs. 7500 |\n| Departmental Canteens at the premises of Central Govt. Institutions | Turnover More than. Rs.12 Lacs | Central License | Rs. 2000 |\n| Food Service Establishment involved in preparation and serving of food for consumption of a group of individuals working or visiting central | annum Turnover upto Rs. 12 Lacs per annum | Central Registration | Rs. 100 |\n\n|     |     |     |     |\n| --- | --- | --- | --- |\n| Food Business Activities at premises of Airport/Seaport such as Storage, Wholesale, Distribution, Retail etc. Food Service Establishment involved in preparation and serving of food at airports/seaports | No limit on Capacity or Turnover | Central License | Rs. 7500 |\n| Mid-day Meal Caterer - The Midday Meal Scheme is a school meal programme of the Government of India designed to better the nutritional standing of school-age children nationwide. The programme supplies free lunches on working days for children in primary and upper primary classes in | Turnover More than Rs 20 Crores per annum Turnover upto Rs. 20 State Crores per annum | Central License | Rs. 7500 Rs. 2000 |\n| government, government aided, local body, Education Guarantee Scheme, and alternate innovative education centres, Madarsa and Maqtabs supported under Sarva Shiksha Abhiyan, and National Child Labour Project schools run by the ministry of labour. Caterer preparing and transporting food to institutions under Midday meal scheme. | Turnover more than | License |  |\n| Mid-Day Meal Canteen Canteens serving food under mid-day meal scheme in Schools | Rs.12 Lacs per annum Turnover upto Rs 12 Lacs per annum. | State License Registration | Rs. 2000 Rs. 100 |\n| Exporter 100% EOU - FBO having certificate from Ministry of Commerce . Manufacturer Exporter . Merchant/Trader | No limit on Capacity or Turnover | Central License | Rs. 7500 |\n| Caterers/Restaurants/Canteens/Hawkers/Petty Retailers at the premises of Railway Stations | Turnover More than Rs.12 Lacs per annum | Central License | Rs. 2000 |\n| E-Commerce | Turnover upto Rs. 12 Lacs per annum. No limit on Capacity. or Turnover | \\[Railways\\] Central Registration Central | Rs. 100 Rs. 7500 |\n| E-commerce also known as electronic commerce or internet commerce, refers to the buying and selling of goods or services using the internet, and the transfer of money and data to execute these transactions. Ecommerce is often used to refer to the sale of physical products online, but it can also describe any kind of commercial transaction that is facilitated through the internet. |  | License |  |\n| Head Office/Registered Office Food Business Operators having food business activities in two or more States/uTs have to declare one Head Office/Registered Office. Documents for Head office License only Documents for Head Office License along with Food Business Activity | No limit on Capacity or Turnover | Central License | Rs. 7500 |","metadata":{"scrapeId":"bee3af9c-e8e4-4f6e-9afe-071a1a0440c4","sourceURL":"https://foscos.fssai.gov.in/assets/docs/KindofBusinessEligibilityLatest.pdf","url":"https://foscos.fssai.gov.in/assets/docs/KindofBusinessEligibilityLatest.pdf","statusCode":200,"numPages":6,"proxyUsed":"basic","cacheState":"hit","cachedAt":"2025-09-04T16:20:04.132Z","creditsUsed":6}}],"metadata":{}}